src/Documents/НачислениеОплатыЗаОбучение/НачислениеОплатыЗаОбучение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеОплатыЗаОбучение</name>
  <registerRecords>AccumulationRegister.ОстаткиНачисленийСтудентов</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗачисленнойОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/ОстаткиНачисленийСтудентов/ОстаткиНачисленийСтудентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНачисленийСтудентов</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/РегистрОпераций/РегистрОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрОпераций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТипОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/НачислениеОплатыЗаОбучение/ObjectModule.bsl
//@skip-check module-structure-method-in-regions
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ОстаткиНачисленийСтудентов
	Движения.ОстаткиНачисленийСтудентов.Записывать = Истина;
	Движение = Движения.ОстаткиНачисленийСтудентов.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Студент = Студент;
	Движение.Сумма = СуммаЗачисленнойОплаты;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	ЗаписьОперации = РегистрыСведений.РегистрОпераций.СоздатьМенеджерЗаписи();
	ЗаписьОперации.Период = Дата;
	ЗаписьОперации.ТипОперации = "Начисление оплаты";
	ЗаписьОперации.Студент = Студент;
	ЗаписьОперации.Сумма = СуммаЗачисленнойОплаты;
	ЗаписьОперации.Записать();
КонецПроцедуры
